Revit 2027 API
PartMakerMethodToDivideVolumes.DivisionRotationAngle Property
 Angle by which both u- and v- gridlines of the division are rotated with respect to the natural u/v-const directions of the sketch plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DivisionRotationAngle { get; set; }
Public Property DivisionRotationAngle As Double
	Get
	Set
public:
property double DivisionRotationAngle {
	double get ();
	void set (double value);
}
member DivisionRotationAngle : float with get, set
Property Value
Double
See Also
Reference
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace